app/Controllers/Barang.php

SELECT *
FROM `barang`
WHERE `barang`.`brgkode` = 'TIKMUL0016'
SELECT *
FROM `kategori`
SELECT *
FROM `satuan`
---
        public function editform($id){
        $rwd = $this->barang->find($id);
        if($rwd){
        $data = [
        'kodebarang' => $rwd['brgkode'],
        'namabarang' => $rwd['brgnama'],
        'kategoribarang' => $rwd['brgkatid'],
        'satuanbarang' => $rwd['brgsatid'],
        'stokbarang' => $rwd['brgstok'],
        'hargabarang' => $rwd['brgharga'],
        'gambarbarang' => $rwd['brggambar'],
        'slkategori' => $this->kategori->findAll(),
        'slsatuan' => $this->satuan->findAll()
        ];