app/Controllers/Barangmasuk.php

SELECT *
FROM `barangmasuk`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `barangmasuk`
---
   public function data(){

        $tombolcari = $this->request->getPost('tombolcari');

        if(isset($tombolcari)){
            $cari = $this->request->getPost('cari');
            session()->set('cari_faktur',$cari);
            redirect()->to('/barang/data');
        }else{
            $cari = session()->get('cari_faktur');
        }

        $totaldata = $cari ? $this->mdbarangmasuk->tampildata_cari($cari)->countAllResults() : $this->mdbarangmasuk->countAllResults();

        $dataBarangmasuk = $cari ? $this->mdbarangmasuk->tampildata_cari($cari)->paginate(10, 'barangmasuk') : $this->mdbarangmasuk->paginate(10, 'barangmasuk');