app/Controllers/Kembalibarang.php

SELECT COUNT(*) AS `numrows`
FROM `detailpinjambarang`
WHERE `detkodeinv` = 'INV2205250001'
---
    public function listtabeldata(){
        if($this->request->isAJAX()){
            $builder    =  $this->mKembali->tampildata();
            return DataTable::of($builder)->addNumbering()
            ->add('tanggalpemakaian', function($row){
                $hari = $this->hari(date('D', strtotime($row->tglpinjam)));
                return $hari.", ".date('d-m-Y',strtotime($row->tglpinjam));
            })
            ->add('tanggalpengembalian', function($row){
                $hari = $this->hari(date('D', strtotime($row->tglkembali)));
                return $hari.", ".date('d-m-Y',strtotime($row->tglkembali));
            })
            ->add('jmlalat', function($row){
                $db       = \Config\Database::connect();
                $jmlItem  = $db->table('detailpinjambarang')->where('detkodeinv',$row->kkdinv)->countAllResults();