app/Controllers/Lpb.php

SELECT COUNT(*) AS `numrows`
FROM `detailpinjambarang`
WHERE `detkodeinv` = 'INV2205300001'
---
    public function listtabeldata(){
        if($this->request->isAJAX()){


            $tanggal    = $this->request->getPost('tanggal');
            $tglawal    = $this->request->getPost('startDate');
            $tglakhir   = $this->request->getPost('endDate');
            // $data = explode(' - ', $tanggal);
            // $data  = [
            //     'tampildata' => $this->mKembali->laporanpb($tglawal,$tglakhir)->get()
            // ];

            // $json = [
            //     'data'     => view('laporan/tabeldata',$data)
            // ];

            $builder    =  $this->mKembali->laporanpb($tglawal,$tglakhir);
            return DataTable::of($builder)->addNumbering()
            ->add('tanggalpemakaian', function($row){
                $hari = $this->hari(date('D', strtotime($row->tglpinjam)));
                return $hari.", ".date('d-m-Y',strtotime($row->tglpinjam));
            })
            ->add('tanggalpengembalian', function($row){
                $hari = $this->hari(date('D', strtotime($row->tglkembali)));
                return $hari.", ".date('d-m-Y',strtotime($row->tglkembali));
            })
            ->add('jmlalat', function($row){
                $db       = \Config\Database::connect();
                $jmlItem  = $db->table('detailpinjambarang')->where('detkodeinv',$row->kkdinv)->countAllResults();