app/Controllers/Pinjambarang.php

    public function listtabeldata(){
        if($this->request->isAJAX()){
            $builder    =  $this->mPinjam->tampildata();
            return DataTable::of($builder)->addNumbering()
            ->add('tanggalpemakaian', function($row){
                $hari = $this->hari(date('D', strtotime($row->tglpinjam)));
                return $hari.", ".date('d-m-Y',strtotime($row->tglpinjam));
            })
            ->add('jmlalat', function($row){
                $db       = \Config\Database::connect();
                $jmlItem  = $db->table('detailpinjambarang')->where('detkodeinv',$row->kodeinv)->countAllResults();
                return
                "<span style='cursor:pointer; font-weight: bold; color:blue'
                onclick='detailItem(\"$row->kodeinv\")'>".number_format($jmlItem, 0, ',', '.')."</span>";
            })
            ->add('aksi', function($row){
            $kdkodeinv = sha1($row->kodeinv);
            return
            "<button type='button' class='btn btn-sm btn-info' title='edit data'
            onclick='print(\"$kdkodeinv\")'>
            <i class='fa fa-print'></i>
            </button>
            &nbsp;
            <button type='button' class='btn btn-sm btn-info' title='edit data' onclick='edit(\"$kdkodeinv\")'><i
                    class='fa fa-edit'></i>
            </button>
            &nbsp;
            <form method='POST' action='/pinjambarang/hapusTransaksi/$row->kodeinv' style='display:inline;' onsubmit='hapus()'><input type='hidden'
---
SELECT COUNT(*) AS `numrows`
FROM `detailpinjambarang`
WHERE `detkodeinv` = 'INV2205300001'