app/Controllers/Satuan.php

    public function index()
    {
        //

        $tombolcari = $this->request->getPost('tombolcari');

        if(isset($tombolcari)){
            $cari = $this->request->getPost('cari');
            session()->set('cari_satuan',$cari);
            redirect()->to('/satuan/index');
        }else{
            $cari = session()->get('cari_satuan');
        }

         $dataSatuan = $cari ? $this->md->cariData($cari)->paginate(5, 'satuan') : $this->md->paginate(5, 'satuan');
---
SELECT *
FROM `satuan`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `satuan`