app/Controllers/Usermag.php

    private function _getdataprofile($id){
        $this->builder->select('users.id as userid, username, email, user_image as picture, fullname')
                      ->Where([
            'sha1(users.id)' => $id
        ]);
---
SELECT `users`.`id` as `userid`, `username`, `email`, `user_image` as `picture`, `fullname`
FROM `users`
WHERE sha1(users.id) = 'bd307a3ec329e10a2cff8fb87480823da114f8f4'