app/Models/Modeldetailpinjambarang.php

    public function dataDetail($faktur){
        return $this->table('detailpinjambarang')
        ->join('barang','brgkode=detbrgkode')
        ->where('detkodeinv',$faktur)->get();
---
SELECT *
FROM `detailpinjambarang`
JOIN `barang` ON `brgkode`=`detbrgkode`
LEFT JOIN `satuan` ON `brgsatid`=`satid`
WHERE `detkodeinv` = 'INV2205250001'