app/Models/Modelpinjambarang.php

    public function cekFaktur($faktur){
        return $this->table('pinjambarang')->getWhere([
            'sha1(kodeinv)' => $faktur
        ]);
---
SELECT *
FROM `pinjambarang`
WHERE sha1(kodeinv) = 'b6eff3d7fdd81efa2e429c85722f166738b4ed00'