app/Models/Modeltemdetailpinjambarang.php

    public function tampilDataTemp($faktur){
        return $this->table('tmp_pinjambarang')->join('barang','brgkode = detbrgkode')->where(['detkodeinv' => $faktur])->get();
---
SELECT *
FROM `tmp_pinjambarang`
JOIN `barang` ON `brgkode` = `detbrgkode`
WHERE `detkodeinv` = 'INV2205270001'