app/Models/Modeltembarangmasuk.php

    public function tampilDataTemp($faktur){
        return $this->table('tem_barangmasuk')->join('barang','brgkode = detbrgkode')->where(['detfaktur' => $faktur])->get();
---
SELECT *
FROM `tmp_barangmasuk`
JOIN `barang` ON `brgkode` = `detbrgkode`
WHERE `detfaktur` = ''