app/Views/laporan/tabeldata.php

                <td>
                    <?php
        $db = \Config\Database::connect();
        $jmlItem = $db->table('detailpinjambarang')->where('detkodeinv',$row['kkdinv'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `detailpinjambarang`
WHERE `detkodeinv` = 'INV2205240001'